---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeFlowConfigurationType
source: html/5c43fb93-bf62-2011-1303-9c50d6a47632.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFlowConfigurationType

An enumerated type listing all connector flow configuration

## Syntax (C#)
```csharp
public enum PipeFlowConfigurationType
```